//#include <stdio.h>
//int main(){
//	char c;
//	scanf("%c", &c);
//	printf("%d", c);
//	return 0;
//}
//
//
///* 9653廓 僥薯 六六六六
//
//#include <stdio.h>
//int main(){
//printf("    8888888888  888    88888\n");
//printf("   88     88   88 88   88  88\n");
//printf("    8888  88  88   88  88888\n");
//printf("       88 88 888888888 88   88\n");
//printf("88888888  88 88     88 88    888888\n");
//printf("\n");
//printf("88  88  88   888    88888    888888\n");
//printf("88  88  88  88 88   88  88  88\n");
//printf("88 8888 88 88   88  88888    8888\n");
//printf(" 888  888 888888888 88  88      88\n");
//printf("  88  88  88     88 88   88888888\n");
//return 0;
//}
//
//*/